# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'awscli'
brew 'bat'
brew 'coreutils'
brew 'exiftool'
brew 'ffmpeg'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config'
brew 'pngpaste'
brew 'tidy-html5'
brew 'trash'
brew 'tree'
brew 'zlib'

# Dev tools
brew 'php'
brew 'composer'
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'

# Apps
cask 'alfred'
cask 'authy'
cask 'caffeine'
cask 'discord'
cask 'docker'
cask 'insomnia'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'firefox'
cask 'github'
cask 'google-chrome'
cask 'numi'
cask 'slack'
cask 'tableplus'
cask 'telegram-desktop'
cask 'textmate'
cask 'tinkerwell'
cask 'transmission'
cask 'transmit'
cask 'vlc'
cask 'zoom'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

